import React, { useState } from "react";
import classnames from "classnames";
import { useRouter } from 'next/router'
import Link from "next/link";

export default function Header({ items, isLoad }) {
  const [blackColorMenu, setColorMenu] = useState(true);
  const location = useRouter();

  const mobileMenu = React.useRef();

  React.useEffect(() => {
    if (location.asPath !== "/") {
      setColorMenu(true);
    } else {
      setColorMenu(false);
    }

    closeSubmenu();
  }, [location.asPath]);

  const [stateMobileMenu, setStateMobileMenu] = useState(false);

  const toggleMobileMenu = () => {
    if (window.innerWidth < 800) {
      if (stateMobileMenu === false) {
        document.body.style.overflow = "hidden";
      } else {
        document.body.style.overflow = "visible";
      }

      setStateMobileMenu(!stateMobileMenu);
    }
  };

  const submenuList = React.useRef();
  const submenuLink = React.useRef();

  const openSubmenu = () => {
    submenuList.current.classList.add("header__submenu-list--open");
    submenuLink.current.classList.add("header__menu-link--submenu--open");
  };

  const closeSubmenu = () => {
    submenuList.current.classList.remove("header__submenu-list--open");
    submenuLink.current.classList.remove("header__menu-link--submenu--open");
  };

  return (
    <header
      className={classnames("header", {
        "header--dark": blackColorMenu,
      })}
    >
      <div className="header__top">
        <div className="container">
          <div className="header__top-wrapper">
            <div className="header__top-social-list">
              <a
                href="https://t.me/+79052445577"
                className="header__top-social-link header__top-social-link--telegram"
              >
                <svg className="header__top-social-icon" width="48" height="48" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path className="header__top-social-icon--color" fillRule="evenodd" clipRule="evenodd" d="M48 24C48 37.2548 37.2548 48 24 48C10.7452 48 0 37.2548 0 24C0 10.7452 10.7452 0 24 0C37.2548 0 48 10.7452 48 24ZM16.0715 21.8015C13.6673 22.8512 11.1971 23.9298 8.93825 25.174C7.75877 26.0376 9.32638 26.6485 10.7971 27.2215C11.0309 27.3126 11.2622 27.4027 11.4797 27.4927C11.6607 27.5484 11.8447 27.607 12.0312 27.6664C13.6669 28.1875 15.4907 28.7686 17.0787 27.8945C19.6873 26.396 22.149 24.6636 24.6089 22.9325C25.4148 22.3653 26.2205 21.7983 27.0311 21.2397C27.0691 21.2154 27.1119 21.1876 27.1588 21.1573C27.8493 20.7096 29.4024 19.7029 28.8279 21.0901C27.4695 22.5757 26.0144 23.8907 24.5515 25.213C23.5655 26.1041 22.5759 26.9985 21.6099 27.9505C20.7686 28.6341 19.8949 30.0088 20.837 30.9661C23.0069 32.4851 25.2107 33.9673 27.4132 35.4487C28.1299 35.9307 28.8466 36.4127 29.5618 36.8959C30.774 37.8637 32.6685 37.0808 32.935 35.5685C33.0535 34.8728 33.1725 34.1772 33.2915 33.4815C33.9491 29.6368 34.6069 25.7907 35.188 21.9335C35.267 21.3284 35.3565 20.7234 35.4461 20.1181C35.6632 18.651 35.8806 17.1821 35.9485 15.7071C35.7735 14.2351 33.9887 14.5588 32.9955 14.8898C27.8903 16.8324 22.8361 18.919 17.8019 21.0424C17.2316 21.295 16.6535 21.5474 16.0715 21.8015Z" />
                </svg>
              </a>
              <a
                href="https://wa.me/79052445577"
                className="header__top-social-link header__top-social-link--telegram"
              >
                <svg className="header__top-social-icon" width="48px" height="48px" viewBox="0 0 48 48" version="1.1">
                  <defs></defs>
                  <g id="Icons" stroke="none" strokeWidth="1" fill="none" fillRule="evenodd">
                    <g className="header__top-social-icon--color" id="Black" transform="translate(-700.000000, -360.000000)" fill="#333">
                      <path d="M723.993033,360 C710.762252,360 700,370.765287 700,383.999801 C700,389.248451 701.692661,394.116025 704.570026,398.066947 L701.579605,406.983798 L710.804449,404.035539 C714.598605,406.546975 719.126434,408 724.006967,408 C737.237748,408 748,397.234315 748,384.000199 C748,370.765685 737.237748,360.000398 724.006967,360.000398 L723.993033,360.000398 L723.993033,360 Z M717.29285,372.190836 C716.827488,371.07628 716.474784,371.034071 715.769774,371.005401 C715.529728,370.991464 715.262214,370.977527 714.96564,370.977527 C714.04845,370.977527 713.089462,371.245514 712.511043,371.838033 C711.806033,372.557577 710.056843,374.23638 710.056843,377.679202 C710.056843,381.122023 712.567571,384.451756 712.905944,384.917648 C713.258648,385.382743 717.800808,392.55031 724.853297,395.471492 C730.368379,397.757149 732.00491,397.545307 733.260074,397.27732 C735.093658,396.882308 737.393002,395.527239 737.971421,393.891043 C738.54984,392.25405 738.54984,390.857171 738.380255,390.560912 C738.211068,390.264652 737.745308,390.095816 737.040298,389.742615 C736.335288,389.389811 732.90737,387.696673 732.25849,387.470894 C731.623543,387.231179 731.017259,387.315995 730.537963,387.99333 C729.860819,388.938653 729.198006,389.89831 728.661785,390.476494 C728.238619,390.928051 727.547144,390.984595 726.969123,390.744481 C726.193254,390.420348 724.021298,389.657798 721.340985,387.273388 C719.267356,385.42535 717.856938,383.125756 717.448104,382.434484 C717.038871,381.729275 717.405907,381.319529 717.729948,380.938852 C718.082653,380.501232 718.421026,380.191036 718.77373,379.781688 C719.126434,379.372738 719.323884,379.160897 719.549599,378.681068 C719.789645,378.215575 719.62006,377.735746 719.450874,377.382942 C719.281687,377.030139 717.871269,373.587317 717.29285,372.190836 Z" id="Whatsapp"></path>
                    </g>
                  </g>
                </svg>
              </a>
            </div>
            <div className="header__top-contact-list">
              <div className="header__top-contact-item">
                <a
                  href="https://yandex.ru/maps/-/CCUUjZuDoA"
                  className="header__top-contact-link"
                >
                  Москва, Покровский б-р, 4/17с1
                </a>
                <span className="header__top-contact-text">
                  Офис компании
                </span>
              </div>
              <div className="header__top-contact-item">
                <a href="tel:79052445577" className="header__top-contact-link">
                  +7 (905) 244-55-77
                </a>
                <span className="header__top-contact-text">
                  Консультирование
                </span>
              </div>
              <div className="header__top-contact-item">
                <a
                  href="mailto:mvp@kenoll.ru"
                  className="header__top-contact-link"
                >
                  mvp@kenoll.ru
                </a>
                <span className="header__top-contact-text">
                  Электронный адрес
                </span>
              </div>
            </div>
          </div>
        </div>
      </div>

      <div className="header__menu">
        <div className="container">
          <div className="header__menu-wrapper">
            <div className="header__menu-left-container">
              <Link className="header__menu-logo" href="/">
                <svg className="header__menu-logo-img" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 837.16 448.9"><g id="Слой_2" data-name="Слой 2"><g id="Слой_1-2" data-name="Слой 1"><path d="M30,120.49v65.36H0V0H50.67Q72.73,0,85.86,17.1T99,61.52q0,27.32-13,43.15T50.06,120.49Zm0-31.27H50.67A15.07,15.07,0,0,0,64,82.2q4.69-7,4.7-20.42,0-13.92-4.8-22.15T51,31.27H30Z" /><path d="M157.78,117.94H142.87v67.91h-30V0h47.91q22.58,0,34.88,14.62t12.31,41.54q0,37-21.55,51.82l26.05,76.08v1.79H180.16ZM142.87,86.67h17.06q9,0,13.48-7.47t4.5-20q0-28-17.47-28H142.87Z" /><path d="M259.5,185.85h-30V0h30Z" /><path d="M323.52,0l28.1,134.41L379.61,0h39.22V185.85H388.7V135.56l2.76-77.48L361.73,185.85H341.3L311.57,58.08l2.76,77.48v50.29h-30V0Z" /><path d="M514.09,147.81h-41l-8,38H433.39L479.87,0h27.48l46.78,185.85H522.06Zm-34.43-31.27h27.79L493.56,50.29Z" /><path d="M79.84,380.86H31.26v65.83H0V285.32H85.69v27.15H31.26v41.34H79.84Z" /><path d="M132.58,446.69H101.32V285.32h31.26Z" /><path d="M266,446.69H234.7L189,340.85V446.69H157.73V285.32H189l45.82,106V285.32H266Z" /><path d="M364.46,376.87H315.77v42.78h57.62v27H284.51V285.32h88.67v27.15H315.77V350.6h48.69Z" /><path d="M450.21,404.35q0-9.86-4.84-14.91T427.77,379q-23.28-9.2-33.48-21.55a44.42,44.42,0,0,1-10.21-29.21q0-20.38,13.87-32.75t35.25-12.35a51,51,0,0,1,25.41,6.26A42.63,42.63,0,0,1,475.78,307a54.92,54.92,0,0,1,6,25.94H450.63q0-11.31-4.62-17.24t-13.34-5.93q-8.19,0-12.76,5.05t-4.57,13.57a17.06,17.06,0,0,0,5.1,12q5.1,5.37,18.07,11.14,22.65,8.53,32.91,20.94t10.26,31.59q0,21.06-12.87,32.92t-35,11.85a58.26,58.26,0,0,1-27.32-6.42,47,47,0,0,1-19.29-18.4q-7-12-7-28.26h31.37q0,14,5.2,20.28t17,6.32Q450.21,422.42,450.21,404.35Z" /><path d="M596.13,312.47H557.86V446.69H526.49V312.47H488.86V285.32H596.13Z" /><path d="M654.45,387.73H638.93v59H607.67V285.32h49.86q23.49,0,36.31,12.69t12.81,36.08q0,32.13-22.43,45l27.11,66.06v1.55h-33.6Zm-15.52-27.16h17.75q9.36,0,14-6.48t4.68-17.34q0-24.27-18.18-24.28H638.93Z" /><path d="M795.48,413.66H752.85l-8.29,33H711.49l48.38-161.37h28.59l48.7,161.37H803.77Zm-35.83-27.15h28.92L774.11,329Z" /></g></g></svg>
              </Link>

              <button
                onClick={toggleMobileMenu}

                // className={classnames("header", {
                //   "header--dark": blackColorMenu,
                // })}

                className={classnames(
                  "header__nav-toggle",
                  {
                    "header__nav-toggle--open": stateMobileMenu,
                  },
                  { "header__nav-toggle--black": blackColorMenu }
                )}
                type="button"
              >
                <span className="header__nav-decoration header__nav-decoration--white">
                  <span className="header__nav-text"></span>
                </span>
              </button>

              <nav
                ref={mobileMenu}
                onClick={toggleMobileMenu}
                className={classnames("header__nav header__nav--closed", {
                  "header__nav--open": stateMobileMenu,
                })}
                id="header__nav"
              >
                <div className="header__nav-wrapper">
                  <ul className="header__menu-list">
                    <li className="header__menu-item">
                      <Link className="header__menu-link" href="/">
                        Главная
                      </Link>
                    </li>
                    <li
                      onMouseEnter={openSubmenu}
                      className="header__menu-item header__menu-item--submenu"
                    >
                      <span
                        ref={submenuLink}
                        className="header__menu-link header__menu-link--submenu header__menu-link--submenu-top"
                        href="/catalog-roofing-accessories"
                      >
                        Каталог
                      </span>
                      <ul
                        onMouseLeave={closeSubmenu}
                        ref={submenuList}
                        className="header__submenu-list"
                      >
                        <li className="header__submenu-item">
                          <Link
                            className="header__menu-link-container"
                            href="/catalog/skylights"
                          >
                            <div className="header__menu-link--icon">
                              <svg className={classnames("header__menu-link--icon-svg", {
                                "header__menu-link--icon-svg-dark": blackColorMenu,
                              })} xmlns="http://www.w3.org/2000/svg" viewBox="0 0 116.28 102.81"><title>Ресурс 9</title><g id="Слой_2" data-name="Слой 2"><g id="Слой_1-2" data-name="Слой 1"><path d="M60.85,99.83h39.41c-.34-1.62-.65-3.16-1-4.69Q98.19,90,97.07,84.78c0-.24-.09-.48-.14-.71-.18-.83.1-1.41.81-1.59s1.12.24,1.29,1q.61,2.79,1.21,5.58,1.19,5.53,2.35,11.07c.37,1.72,0,2.24-1.57,2.24H23.39c-1.41,0-1.57-.14-1.92-1.76L.56,2.62C.22,1,.6.46,2,.46H80a1.79,1.79,0,0,1,1.79,1.27q11.9,25.34,23.83,50.64,4.92,10.45,9.86,20.92c.81,1.71.41,2.46-1.3,2.46q-20.19,0-40.38,0a1.6,1.6,0,0,0-1.66,1.07c-3.58,7.36-7.21,14.68-10.82,22C61.13,99.1,61,99.41,60.85,99.83ZM3.36,3c.28.6.48,1.06.69,1.51Q20,38.33,35.91,72.18a1.57,1.57,0,0,0,1.63,1.11q37.18,0,74.39,0c.29,0,.58,0,.94-.06-.16-.38-.26-.63-.38-.87q-4.68-10-9.37-19.92Q91.72,28.22,80.34,4A1.57,1.57,0,0,0,78.7,2.91q-37.11,0-74.21,0C4.17,2.93,3.84,3,3.36,3ZM70.1,75.75H68.59c-10.66,0-21.32,0-32,0a2.18,2.18,0,0,1-2.22-1.53q-14.52-31-29.12-61.89c-.1-.21-.24-.41-.36-.61a1.76,1.76,0,0,0,0,.76Q14.12,55.61,23.3,98.71c.2,1,.52,1.2,1.34,1.2q16.28,0,32.54,0a1.54,1.54,0,0,0,1.58-1q5.35-11,10.77-21.91Z" /><path d="M87.23,88.25c-.31-1.46-.55-2.75-.85-4-.19-.85,0-1.51.74-1.74s1.2.29,1.37,1.12c.38,1.8.79,3.58,1.15,5.38.22,1.09-.19,1.71-1.18,1.71H71.29a1.09,1.09,0,0,1-1.22-1.21,1.15,1.15,0,0,1,1.32-1.23H87.23Z" /><path d="M100.62,62.44Q88.88,37.51,77.13,12.57a1.8,1.8,0,0,0-1.81-1.25q-29.16,0-58.31,0c-1.75,0-2.15.8-1.32,2.55Q27.35,38.66,39,63.41a2.1,2.1,0,0,0,2.16,1.47c9.67,0,19.34,0,29,0h29.2C101,64.86,101.4,64.09,100.62,62.44ZM67.13,13.84c2.5,0,5-.05,7.49,0a1.49,1.49,0,0,1,1,.82q8.94,18.88,17.83,37.79,2.07,4.38,4.12,8.76c.15.31.27.62.51,1.16H66.49c-8.13,0-16.26,0-24.39,0a1.5,1.5,0,0,1-1.58-1Q29.62,38.12,18.65,14.89c-.13-.27-.25-.56-.43-1" /><path d="M44.27,90.71c-4.34,0-8.69,0-13,0-.92,0-1.4-.35-1.62-1.4-1.23-5.93-2.52-11.84-3.77-17.77a2.53,2.53,0,0,1,0-1.31,1.27,1.27,0,0,1,.89-.72,1.49,1.49,0,0,1,1,.6,2.4,2.4,0,0,1,.29,1c1.15,5.38,2.32,10.75,3.43,16.14.17.83.47,1,1.18,1,8.16,0,16.32,0,24.48,0,.31,0,.71-.1.9.08a2.12,2.12,0,0,1,.75,1.24c0,.36-.46.8-.8,1.08-.19.15-.54,0-.82,0Z" /></g></g></svg>
                            </div>
                            <span className="header__menu-link header__menu-link--submenu">
                              Мансардные<br /> окна
                            </span>
                          </Link>
                        </li>
                        <li className="header__submenu-item">
                          <Link
                            className="header__menu-link-container"
                            href="/catalog/roofing-materials"
                          >
                            <div className="header__menu-link--icon">
                              <svg className={classnames("header__menu-link--icon-svg", {
                                "header__menu-link--icon-svg-dark": blackColorMenu,
                              })}
                                xmlns="http://www.w3.org/2000/svg"
                                viewBox="0 0 103.45 103.15"><title>Ресурс 4</title>
                                <g id="Слой_2" data-name="Слой 2">
                                  <g id="Слой_1-2" data-name="Слой 1">
                                    <path d="M103.44,2.25c0-1.86-.35-2.21-2.2-2.21L92.42,0C78.77,0,66.08,0,53.62,0L41.79,0H20.07c-1.57,0-2,.41-2,2V17.7H2C.52,17.7.1,18.12.08,19.55l0,2.14c0,3-.06,6.07-.06,9.11,0,3.52,0,7,0,10.57q0,4,0,8.07,0,4.71,0,9.42V73q0,13.83,0,27.66c0,1.11.13,1.74.42,2s.9.42,2,.42H82.18c1.65,0,2.54-.06,2.88-.41s.41-1.25.41-2.9V85.44h15.72c1.94,0,2.25-.32,2.25-2.27V2.25Zm-31,.67c4.17,0,8.3,0,12.51,0h2.36a1.42,1.42,0,0,1,.42.07l1.65.41-9.17,7.11Q76.06,13.73,71.86,17a2.75,2.75,0,0,1-1.59.71c-3.07,0-6.13,0-9.2,0H54.62l-1.06-1.27.84-.38.26-.11a1.47,1.47,0,0,0,.27-.12l5.65-4.37L70.74,3.6A3.15,3.15,0,0,1,72.47,2.92Zm-23,0h0c3.79,0,7.64,0,11.37,0H64l.44,0,2,.17-1.7,1.44L64.21,5l-2,1.53Q55.5,11.79,48.76,17a3.22,3.22,0,0,1-1.72.69c-2.76,0-5.53,0-8.29,0H32.27l-.39,0-2.13-.19,7.44-5.78c3.49-2.7,7-5.4,10.48-8.08A3.1,3.1,0,0,1,49.49,2.92ZM21,3h22.8L40.42,5.6,37,8.22l-3,2.33-.1.08c-2.46,1.87-5,3.81-7.42,5.82a5.31,5.31,0,0,1-3.61,1.25,9.79,9.79,0,0,1-1.26-.08L21,17.55ZM3,20.64H82l-1.11,2.44c-.67,1.47-1.3,2.85-2,4.23-.39.77-1.63.79-1.77.79-3.35,0-6.71,0-10.06,0H3ZM61,49.76h-.49c-6-.19-12.2-.16-18.15-.12h-.29l-7.35,0H3V42.22H70.55l-.78,1.1-.64.88A11.43,11.43,0,0,0,68,45.81C66.59,48.54,64.42,49.76,61,49.76Zm.89,2.81-.6,1-.06.11a1.49,1.49,0,0,1-.35.52L60,55c-1.92,1.7-3.9,3.47-5.89,5.17a3,3,0,0,1-1.77.67l-9.6,0h-8a2.19,2.19,0,0,1-.42,0l-.83-.11V52.57ZM3.05,39.25V31H47.51v8.23Zm54.25,0H50.63V31H77.15l-1.5,2.59c-1,1.69-1.89,3.29-2.84,4.89a1.69,1.69,0,0,1-1.29.78ZM3,55c0-.6,0-1.16,0-1.72v-.7H30.41v8.3H21.24c-5.33,0-10.85,0-16.28,0a2.15,2.15,0,0,1-1.58-.49,2.07,2.07,0,0,1-.44-1.58C3,57.56,3,56.31,3,55Zm0,8.74H45.28l.34,1.51L45,65.4l-1.65.45a28.89,28.89,0,0,1-3.73.87c-14.5,2-25.72,9.8-34.31,23.73-.26.42-.52.84-.79,1.26l-.12.18L3,92.51Zm79.42,36.43H3.5l.86-1.9c.28-.62.54-1.2.82-1.77,4.47-9,10.21-15.78,17.56-20.62a41.57,41.57,0,0,1,17-6.29c6.66-1,12.88-4,19-9.25,7.39-6.28,13.54-14.32,20-26.07.53-1,1-2,1.57-3l2.17-4.2ZM100.53,82.5h-15V80.8c0-.86,0-1.66,0-2.45A2,2,0,0,1,86.23,77c3.49-2.65,7-5.28,10.58-8l3.72-2.8Zm.07-21.13a2.41,2.41,0,0,1-.8,1.79c-3.54,2.69-7.16,5.4-10.65,8l-2.06,1.54a1.09,1.09,0,0,1-.41.17l-1.16.35V65.71c0-1.18,0-2.41,0-3.61a2.27,2.27,0,0,1,.65-1.64c3.59-2.73,7.2-5.43,10.7-8.05l3.41-2.56.19,1.15c0,.12,0,.22.05.31a2.85,2.85,0,0,1,.08.62v1.35C100.63,56,100.64,58.69,100.6,61.37Zm0-16.53a2.37,2.37,0,0,1-.81,1.79c-3.54,2.71-7.11,5.37-10.56,7.95l-2.15,1.61a1,1,0,0,1-.41.18l-1.15.35v-.95c0-.76,0-1.51,0-2.26a37.31,37.31,0,0,0-.09-4.88c-.34-3,.66-5,3.34-6.78,2.51-1.66,4.86-3.46,7.34-5.38L99.38,34l.93-.69.18,1.15c0,.11,0,.21.05.3a3,3,0,0,1,.08.63v1.38C100.63,39.45,100.64,42.17,100.6,44.84ZM85.54,29.08a2.5,2.5,0,0,1,.81-1.78c3.68-2.81,7.38-5.57,11-8.25l1.76-1.32a1.09,1.09,0,0,1,.47-.19l.19-.06.91-.28v5.38c0,1.86,0,3.79,0,5.72a2.43,2.43,0,0,1-.8,1.79c-3.64,2.78-7.34,5.54-10.91,8.21l-1.8,1.35a1.52,1.52,0,0,1-.44.2l-1.13.39v-6.6C85.51,32.13,85.5,30.6,85.54,29.08ZM98.41,14.71c-2.54,1.76-5.06,3.67-7.49,5.52l-.12.1-3,2.29-.65.46-1.61,1.11V21.66c0-.77,0-1.45,0-2.12,0-1.43-.47-1.84-1.89-1.84h-8l2.49-2c.58-.46,1.09-.87,1.61-1.27l3.7-2.85c3.27-2.54,6.66-5.16,10-7.8a4,4,0,0,1,2.85-.94c.79,0,1.58,0,2.42,0h1.89v.7q0,1,0,2c0,1.54,0,3,.06,4.44A4.64,4.64,0,0,1,98.41,14.71Z" />
                                  </g></g>
                              </svg>
                            </div>

                            <span className="header__menu-link header__menu-link--submenu">
                              Подкровельные<br /> мембраны
                            </span>
                          </Link>
                        </li>
                      </ul>
                    </li>
                    <li className="header__menu-item">
                      <Link className="header__menu-link" href="/gallery">
                        Галерея
                      </Link>
                    </li>
                    <li className="header__menu-item">
                      <Link className="header__menu-link" href="/about">
                        О компании
                      </Link>
                    </li>
                    <li className="header__menu-item">
                      <Link className="header__menu-link" href="/contacts">
                        Контакты
                      </Link>
                    </li>
                  </ul>
                </div>
              </nav>
            </div>

            <Link href="/search">
              <div className="header__menu-top-search-button"></div>
            </Link>

          </div>
        </div>
      </div>
    </header >
  );
};
